In [1]:
# Pandas 설치
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.1/11.5 MB 3.5 MB/s eta 0:00:04
   - -------------------------------------- 0.6/11.5 MB 7.1 MB/s eta 0:00:02
   ---- ----------------------------------- 1.2/11.5 MB 9.5 MB/s eta 0:00:02
   ------- -------------------------------- 2.1/11.5 MB 11.9 MB/s eta 0:00:01
   ----------- ---------------------------- 3.3/11.5 MB 14.8 MB/s eta 0:00:01
   ---------------- ----------------------- 4.8/11.5 MB 18.1 MB/s eta 0:00:01
   ------------------------ --------------- 7.0/11.5 MB 22.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.5 MB 27.0 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 38.5 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 38.5 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 27.3 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------------------------------------- 505.5/505.5 kB 31.0 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   --------------------------------------- 345.4/345.4 kB 20.9 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
import numpy as np

In [4]:
obj = ["이유리", "최민준", "김민지"]
print(type(obj))

series_1 = pd.Series(obj)
print(type(series_1))
print(series_1)

<class 'list'>
<class 'pandas.core.series.Series'>
0    이유리
1    최민준
2    김민지
dtype: object

In [7]:
obj = ["이유리", "최민준", "김민지"]
idx = ["A", "B", "C"]

series_2 = pd.Series(obj, index = idx)
print(series_2)

A    이유리
B    최민준
C    김민지
dtype: object

In [9]:
obj = {
    "A" : "이유리",
    "B" : "최민준",
    "C" : "김민지",
}

series_3 = pd.Series(obj)
print(series_3)

A    이유리
B    최민준
C    김민지
dtype: object

In [10]:
series_1

0    이유리
1    최민준
2    김민지
dtype: object

In [11]:
# values 속성
print(series_1.values)

['이유리' '최민준' '김민지']

In [12]:
# index 속성
print(series_1.index)

RangeIndex(start=0, stop=3, step=1)

In [13]:
# dtypes 속성 -> 시리즈 객체의 데이터 타입 확인
print(series_1.dtypes)

object

In [15]:
# size 속성 -> 총 객체의 수
print(series_1.size)

3

In [18]:
series_1.index = ["A", "B", "C"]
print(series_1.index)

Index(['A', 'B', 'C'], dtype='object')

In [19]:
obj = [22, 32, 27, 18, 38, 19]
idx = list("abcdef") # => ["a", "b", "c", "d", "e", "f"]

sr = pd.Series(obj, index=idx)
print(sr)

a    22
b    32
c    27
d    18
e    38
f    19
dtype: int64

In [22]:
# Series 객체의 인덱싱
print(sr[4])
print(sr[-1])
print(sr["c"])

38
19
27

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10708\3784644433.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[4])
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10708\3784644433.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[-1])

In [24]:
# Series 객체의 슬라이싱
print(sr[1:5])
print(sr[:5])

b    32
c    27
d    18
e    38
dtype: int64
a    22
b    32
c    27
d    18
e    38
dtype: int64

In [26]:
print(sr["b" : "d"])

# 숫자의 경우 마지막에서 하나를 뺀 값
# 키워드로 슬라이싱을 하면 d앞의 c를 가져오는것이 아니라 d까지

b    32
c    27
d    18
dtype: int64

In [29]:
idx = [0, 3, 4]
print(sr[idx])
print(sr[[1, 5]])

a    22
d    18
e    38
dtype: int64
b    32
f    19
dtype: int64

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10708\4119871827.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[idx])
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10708\4119871827.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1, 5]])

In [30]:
print(sr)

a    22
b    32
c    27
d    18
e    38
f    19
dtype: int64

In [31]:
print(sr[["b", "d", "f"]])

b    32
d    18
f    19
dtype: int64

In [34]:
# 통계 method (집계함수)

sr_1 = pd.Series(range(100)) # range(100) => [0, 1, 2, 3, ...99]
print(sr_1)

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [35]:
# 집계함수 describe() -> 요약 통계량에 대한 정보
sr_1.describe()

count    100.000000
mean      49.500000
std       29.011492
min        0.000000
25%       24.750000
50%       49.500000
75%       74.250000
max       99.000000
dtype: float64

In [37]:
# 집계함수 count() = 총 객체 수
sr_1.count()

np.int64(100)

In [38]:
# 집계함수 mean() 평균
sr_1.mean()

np.float64(49.5)

In [39]:
# 집계함수 var( ) 분산
sr_1.var()

np.float64(841.6666666666666)

In [40]:
# 집계함수 std() 표준편차
sr_1.std()

np.float64(29.011491975882016)

In [41]:
print(sr_1.min())
print(sr_1.max())
print(sr_1.median())

0
99
49.5

In [43]:
# quantile() 백분위수
print(sr_1.quantile()) # 아무것도 안적으면 중간값을 도출
print(sr_1.quantile(q=0.25))
print(sr_1.quantile(q=0.75))

49.5
24.75
74.25

In [44]:
sr_2 = pd.Series(["a", "b", "b", "b", "c", "c", "d"])
sr_2.describe()

count     7
unique    4
top       b
freq      3
dtype: object

In [46]:
# unique -> 유일한 값
sr_2.unique() # 어떤 값이 있는지

array(['a', 'b', 'c', 'd'], dtype=object)

In [48]:
# value_counts -> 유일한 값의 빈도수 확인
sr_2.value_counts() # 각 값이 몇 번 나왔는지

b    3
c    2
a    1
d    1
Name: count, dtype: int64

In [49]:
# mode 최빈값
sr_2.mode()

0    b
dtype: object

In [10]:
# 데이터프레임

import pandas as pd

obj1 = {
    "이름" : ["이유리", "최민준", "김민지"],
    "전공" : ["경영학과", "컴퓨터공학과", "데이터과학과"],
    "성별" : ["여", "남", "여"],
    "나이" : [20, 22, 21]

}

df_1 = pd.DataFrame(obj1)
print(df_1)
print(type(df_1))

    이름      전공 성별  나이
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21
<class 'pandas.core.frame.DataFrame'>

In [11]:
import numpy as np

In [12]:
obj2 = np.array([
    ["이유리", "경영학과", "여", "20"],
    ["최민준", "컴퓨터공학과", "남", "22"],
    ["김민지", "데이터과학과", "여", "21"]
])

df_2 = pd.DataFrame(obj2)
print(df_2)

     0       1  2   3
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21

In [13]:
df_3 = pd.DataFrame(
                    obj2,
                    columns=["Name", "Major", "Sex", "Age"],
                    index=["A", "B", "C"]
                    )
df_3

  Name   Major Sex Age
A  이유리    경영학과   여  20
B  최민준  컴퓨터공학과   남  22
C  김민지  데이터과학과   여  21

In [14]:
obj = {
    "Name": ["Olivia", "Lucas", "Sofia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Female"],
    "Age" : [22, 32, 27, 18, 38, 19]
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2   Sofia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot  Female   19

In [15]:
df.values

array([['Olivia', 'Female', 22],
       ['Lucas', 'Male', 32],
       ['Sofia', 'Female', 27],
       ['Zoe', 'Female', 18],
       ['Ava', 'Female', 38],
       ['Elliot', 'Female', 19]], dtype=object)

In [26]:
a = df.values
print(a)
print("-"*24)
print(type(a))

[['Olivia' 'Female' 22]
 ['Lucas' 'Male' 32]
 ['Sofia' 'Female' 27]
 ['Zoe' 'Female' 18]
 ['Ava' 'Female' 38]
 ['Elliot' 'Female' 19]]
------------------------
<class 'numpy.ndarray'>

In [16]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
df.columns #필드(열) 추출

Index(['Name', 'Sex', 'Age'], dtype='object')

In [30]:
df.dtypes

Name    object
Sex     object
Age      int64
dtype: object

In [31]:
df.shape

(6, 3)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Sex     6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [38]:
df.head(1) # 가지고오고싶은 데이터 갯수(-일 경우 뒤에서부터)

     Name     Sex  Age
0  Olivia  Female   22

In [39]:
df.tail()

     Name     Sex  Age
1   Lucas    Male   32
2   Sofia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot  Female   19

In [18]:
obj = {
    "Name": ["Olivia", "Lucas", "Sofia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Female"],
    "Age" : [22, 32, 27, 18, 38, 19]
}

idx = list("abcdef") # ["a", "b" ... "f"]
pd.DataFrame(obj, index=idx)
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2   Sofia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot  Female   19

In [43]:
df["Name"]

0    Olivia
1     Lucas
2     Sofia
3       Zoe
4       Ava
5    Elliot
Name: Name, dtype: object

In [44]:
df.Name

0    Olivia
1     Lucas
2     Sofia
3       Zoe
4       Ava
5    Elliot
Name: Name, dtype: object

In [45]:
print(df[["Name", "Age"]])

     Name  Age
0  Olivia   22
1   Lucas   32
2   Sofia   27
3     Zoe   18
4     Ava   38
5  Elliot   19

In [19]:
df

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2   Sofia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot  Female   19

In [47]:
df.iloc[0]

Name    Olivia
Sex     Female
Age         22
Name: 0, dtype: object

In [48]:
df.iloc[1:5]

    Name     Sex  Age
1  Lucas    Male   32
2  Sofia  Female   27
3    Zoe  Female   18
4    Ava  Female   38

In [20]:
df.iloc[[1, 3, 5]]

     Name     Sex  Age
1   Lucas    Male   32
3     Zoe  Female   18
5  Elliot  Female   19

In [23]:
df.iloc[1:4, 1:3]

      Sex  Age
1    Male   32
2  Female   27
3  Female   18

In [27]:
# (실행안됨,,)df.loc["b", "Name"]

In [26]:
rowm = ["b", "d", "e"]
colum = ["Name", "Sex"]

# df.loc[["b", "d", "e"]], ["Name", "Sex"]
# (실행안됨,,) df.loc[rowm, colum]

In [82]:
obj = {
    "Name": ["Olivia", "Lucas", "Sofia", "Zoe", "Ava", "Elliot"],
    "Sex" : ["Female", "Male", "Female", "Female", "Female", "Female"],
    "Age" : [22, 32, 27, 18, 38, 19],
    "Score" : [100, 95, 60, 77, 83, 84]
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age  Score
0  Olivia  Female   22    100
1   Lucas    Male   32     95
2   Sofia  Female   27     60
3     Zoe  Female   18     77
4     Ava  Female   38     83
5  Elliot  Female   19     84

In [83]:
df.describe()

             Age       Score
count   6.000000    6.000000
mean   26.000000   83.166667
std     7.874008   14.133884
min    18.000000   60.000000
25%    19.750000   78.500000
50%    24.500000   83.500000
75%    30.750000   92.250000
max    38.000000  100.000000